FinalProj/TestMeshes/MeshTest3/system/blockMeshDict1
//Ben Juenger
//COE347 OF3

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1.0;

vertices
(
  (0.000000000000000 0.000000000000000 0.000000000000000) // 0
  (5.000000000000000 0.000000000000000 0.000000000000000) // 1
  (5.500000000000000 0.000000000000000 0.000000000000000) // 2
  (10.500000000000000 0.000000000000000 0.000000000000000) // 3
  (0.000000000000000 0.249914331243889 0.006544237076968) // 4
  (5.000000000000000 0.249914331243889 0.006544237076968) // 5
  (5.500000000000000 0.249914331243889 0.006544237076968) // 6
  (10.500000000000000 0.249914331243889 0.006544237076968) // 7
  (0.000000000000000 0.249914331243889 -0.006544237076968) // 8
  (5.000000000000000 0.249914331243889 -0.006544237076968) // 9
  (5.500000000000000 0.249914331243889 -0.006544237076968) // 10
  (10.500000000000000 0.249914331243889 -0.006544237076968) // 11
  (0.000000000000000 0.499828662487779 0.013088474153937) // 12
  (5.000000000000000 0.499828662487779 0.013088474153937) // 13
  (5.500000000000000 0.499828662487779 0.013088474153937) // 14
  (10.500000000000000 0.499828662487779 0.013088474153937) // 15
  (0.000000000000000 0.499828662487779 -0.013088474153937) // 16
  (5.000000000000000 0.499828662487779 -0.013088474153937) // 17
  (5.500000000000000 0.499828662487779 -0.013088474153937) // 18
  (10.500000000000000 0.499828662487779 -0.013088474153937) // 19
);

blocks
(
  hex (0 1 9 8 0 1 5 4)  (25 25 1) simpleGrading (1.000000 1.000000 1.000000) // 0

  hex (1 2 10 9 1 2 6 5)  (25 25 1) simpleGrading (1.000000 1.000000 1.000000) // 1

  hex (2 3 11 10 2 3 7 6)  (25 25 1) simpleGrading (1.000000 1.000000 1.000000) // 2

  hex (8 9 17 16 4 5 13 12)  (25 25 1) simpleGrading (1.000000 1.000000 1.000000) // 3

  hex (10 11 19 18 6 7 15 14)  (25 25 1) simpleGrading (1.000000 1.000000 1.000000) // 4

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 4 0)
            (8 16 12 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 11 3)
	    (11 7 15 19)
        );
    }
    walls
  {
      type wall;
      faces
      (
         (16 17 13 12)
	 (9 5 13 17)
	 (10 6 5 9)
	 (18 14 6 10)
	 (18 19 15 14)

      );
    }
    wedge1
     { 
           type wedge;
           faces  
           (
               (0 1 9 8)
	       (8 9 17 16)
           );
      }
      wedge2
     { 
           type wedge;
           faces  
           (
               (0 4 5 1)
	       (4 12 13 5)
      
           );
      }	
        wedge3
     { 
           type wedge;
           faces  
           (
               (1 5 6 2)
           );
      }
      wedge4
     { 
           type wedge;
           faces  
           (
               (1 2 10 9)
      
           );
      }	
      wedge5
     { 
           type wedge;
           faces  
           (
               (10 11 19 18)
	       (2 3 11 10)
           );
      }
      wedge6
     { 
           type wedge;
           faces  
           (
               (2 6 7 3)
	       (6 14 15 7)
      
           );
      }	
      empty
    {
        type patch;
        faces
        (
            (0 1 1 0)
            (1 2 2 1)
	    (2 3 3 2)
        );
    }
	

);





	       
	       
	       	
	  
	       